import React from "react";
import Title from "./Title";
import { Button } from "../ui/button";
import { account1, account2, account3, account4 } from "../../../public/images";
import AccountCard from "./AccountCard";

const TypesOfAccounts = () => {
  const data = [
    {
      1: "سبريد يبدأ من 0.8 PIP",
      2: "تنفيذ مباشر وفق نظام STP",
      3: "رافعة مالية تصل إلى 1:500",
      4: "الحد الأدنى لحجم اللوت 0.01",
      5: "الحد الأدنى للإيداع 100 دولار",
      6: "بدون عمولات اضافية",
      7: "حساب اسلامي خالي من عمولة التبييت",
      8: "إمكانية الوصول الى التداول الالي",
      9: "30% بونص على الايداع",
    },
    {
      1: "سبريد منخفص يبدأ من 0.0 PIP",
      2: "تنفيذ مباشر وفق نظام STP",
      3: "رافعة مالية تصل إلى 1:200",
      4: "الحد الأدنى لحجم اللوت 0.01",
      5: "الحد الأدنى للإيداع 5000 دولار",
      6: "العمولة 8 دولار لكل 1 لوت",
      7: "حساب اسلامي خالي من عمولة التبييت",
      8: "إمكانية الوصول الى التداول الالي",
      9: "لا يوجد بونص على الايداع",
    },
    {
      1: "سبريد منخفص يبدأ من 0.0 PIP",
      2: "تنفيذ مباشر وفق نظام STP",
      3: "رافعة مالية تصل إلى 1:50",
      4: "الحد الأدنى لحجم اللوت 0.01",
      5: "الحد الأدنى للإيداع 50,000 دولار",
      6: "العمولة 4 دولار لكل 1 لوت",
      7: "اكثر من 400 اداة قابلة للتداول",
      8: "إمكانية الوصول الى التداول الالي",
      9: "لا يوجد بونص على الايداع",
    },
    {
      1: "سبريد منخفص يبدأ من 5.0 Point",
      2: "تنفيذ مباشر وفق نظام STP",
      3: "رافعة مالية تصل إلى 1:20",
      4: "الحد الأدنى لحجم اللوت 1",
      5: "الحد الأدنى للإيداع 500 دولار",
      6: "بدون عمولات اضافية",
      7: "اكثر من 250 سهم قابل للتداول",
      8: "إمكانية الوصول الى التداول الالي",
      9: "لا يوجد بونص على الايداع",
    },
    {
      1: "سبريد مزود السيولة الخام",
      2: "تنفيذ مباشر وفق نظام STP",
      3: "رافعة مالية تصل الى 1:100",
      4: "الحد الادنى لحجم اللوت 0.01",
      5: "الحد الادنى للايداع 50$",
      6: "اكثر من 144 عملة رقمية قابلة للتداول",
      7: "عمولة تبدأ من $ 0.08",
      8: "حساب اسلامي خالي من عمولة التبييت",
    },
    {
      1: "سبريد منخفص يبدأ من 0.0 PIP",
      2: "تنفيذ مباشر وفق نظام STP",
      3: "رافعة مالية تصل إلى 1:500",
      4: "الحد الأدنى لحجم اللوت 0.01",
      5: "الحد الأدنى للإيداع 50 دولار",
      6: "عمولة تبدأ من $ 0.08",
      7: "حساب اسلامي خالي من عمولة التبييت",
      8: "إمكانية الوصول الى التداول الالي",
      9: "لا يوجد بونص على الايداع",
      10: "اكثر من 230 زوج عملة قابل للتداول",
    },
  ];

  // console.log(data[0]);
  return (
    <div className="w-full px-8 mt-[100px]   max-sm:mt-[10px]">
      <div className="flex flex-col justify-center  items-center text-white">
        <Title className={`mb-8`} title={`أنواع حسابات INZO انزو الحقيقية`} />
        <h2 className="text-[25px] text-center ">
          تقدم INZO انزو عدة أنواع من الحسابات المناسبة لبيئات التداول المختلفة
        </h2>
        <div className="flex gap-8 mt-8">
          <Button variant="red">cTrader</Button>
          <Button variant="red">MT5</Button>
        </div>

        <div className="grid grid-cols-3 max-lg:grid-cols-2 max-md:grid-cols-1 gap-2 gap-y-4 w-full mt-8 justify-center items-center">
          <AccountCard img={account1} dataArr={data[0]} />
          <AccountCard img={account2} dataArr={data[1]} />
          <AccountCard img={account3} dataArr={data[2]} />
          <AccountCard img={account4} dataArr={data[3]} />
          <AccountCard img={account2} dataArr={data[4]} />
          <AccountCard img={account3} dataArr={data[5]} />
        </div>
      </div>
    </div>
  );
};

export default TypesOfAccounts;
